import "../app/globals.css"
import Layout from "../app/layout"

export default function Introduce() {
  return (
    <Layout>
      <h1>Введение в преподавание</h1>
      <img src="/images/introduce/main.png" alt="Ученик и преподаватель" />
      <p>
        Первым делом стоит сразу сказать, что работа с детьми - это настоящее
        удовольствие. Наши маленькие ученики приходят на занятия с отличным
        настроением, они ждут уроков как свое день рождение, рады видеть учителя
        и рассказать ему все свои приключения на выходных. Но, конечно же, важно
        поддерживать баланс между временем для разговоров и временем для
        обучения. 😊
      </p>
      <p>
        Прежде чем ты перейдешь к обучению ведения индивидуальных занятий в
        Школе Программ, давай рассмотрим все прекрасные стороны выбранного тобой
        формата преподавания
      </p>
      <p>
        Итак, основными плюсами индивидуальной работы в нашей школе с учеником
        являются:
      </p>
      <ul>
        <li>
          Атмосфера доверия и открытости между
          преподавателем и учеником. Такое общение является залогом успешного
          процесса обучения, поэтому мы придаем этому большое значение;
        </li>
        <li>
          Один из ключевых аспектов, которые мы обеспечиваем, — это возможность
          свободного диалога между учителем и учеником. Ученик может задавать
          вопросы в любое время и в любом количестве так как занятие ведется в
          диалоге;
        </li>
        <li>
          Мы стараемся выстраивать взаимодействие между преподавателем и
          учеником на основе их общих интересов
        </li>
        <li>
          Комфорт ученика в случае если он не любит конкуренцию (при
          индивидуальном обучении ученик может равняться только на
          преподавателя, который выступает ему другом и ментором, что создает
          дружелюбную атмосферу стремления быть лучше или крутым спецом как
          преподаватель);
        </li>
        <li>
          Гибкий график уроков, ты можешь спокойно совмещать работу в Школе
          Программ с другими сферами;
        </li>
        <li>
          Возможность корректировки материала урока в рамках тематического плана
          (наиболее легкие и понятные темы пройти чуть быстрее и уделить больше
          внимание практике или заданиям со звездочкой, вернуться к теме
          предыдущего урока если тот был не до конца понятен) и др.
        </li>
      </ul>
    </Layout>
  );
}
